/*
Navicat MySQL Data Transfer

Source Server         : root
Source Server Version : 50627
Source Host           : localhost:3306
Source Database       : bluesky

Target Server Type    : MYSQL
Target Server Version : 50627
File Encoding         : 65001

Date: 2016-01-05 09:29:17
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for `admin`
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `ID` varchar(30) NOT NULL,
  `Password` varchar(30) NOT NULL,
  `Name` varchar(30) NOT NULL,
  `Tel` varchar(20) NOT NULL,
  `IDcardNO` varchar(30) NOT NULL,
  `RegisterTime` date NOT NULL,
  `LogoffTime` date NOT NULL,
  PRIMARY KEY (`ID`),
  UNIQUE KEY `IDcardNO` (`IDcardNO`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('00010', 'admin', 'admin', '18811181111', '412232197808082111', '2016-01-04', '2016-01-04');
INSERT INTO `admin` VALUES ('00011', '111', '王先生', '18811181111', '412232197808082112', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00012', '111', '王先生', '18811181111', '412232197808082113', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00013', '111', '王先生', '18811181111', '412232197808082114', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00014', '111', '王先生', '18811181111', '412232197808082115', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00015', '111', '王先生', '18811181111', '412232197808082116', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00016', '111', '王先生', '18811181111', '412232197808082117', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00017', '111', '王先生', '18811181111', '412232197808082118', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00018', '111', '王先生', '18811181111', '412232197808082119', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00019', '111', '王先生', '18811181111', '412232197808082120', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00020', '111', '王先生', '18811181111', '412232197808082121', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00021', '111', '王先生', '18811181111', '412232197808082122', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00022', '111', '李先生', '18811181111', '412232197808082123', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00023', '111', '李先生', '18811111111', '412232197808082124', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00024', '111', '李先生', '18811111111', '412232197808082125', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00025', '111', '李先生', '18811111111', '412232197808082126', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00026', '111', '李先生', '18811111111', '412232197808082127', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00027', '111', '李先生', '18811111111', '412232197808082128', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00028', '111', '李先生', '18811111111', '412232197808082129', '0000-00-00', '0000-00-00');
INSERT INTO `admin` VALUES ('00029', '111', '李先生', '18811111111', '412232197808082130', '0000-00-00', '0000-00-00');

-- ----------------------------
-- Table structure for `constructionsite`
-- ----------------------------
DROP TABLE IF EXISTS `constructionsite`;
CREATE TABLE `constructionsite` (
  `ID` varchar(30) NOT NULL,
  `Project` varchar(100) NOT NULL,
  `Name` varchar(100) NOT NULL,
  `Directory` varchar(30) NOT NULL,
  `Area` double NOT NULL,
  `StartTime` date NOT NULL,
  `CompleteTime` date NOT NULL,
  `TotalFloors` int(4) NOT NULL,
  `Districts` varchar(50) NOT NULL,
  `Streets` varchar(50) NOT NULL,
  `Company` varchar(50) NOT NULL,
  `Struct` varchar(200) NOT NULL,
  `Price` double NOT NULL,
  `TotalMonitors` int(11) NOT NULL,
  `Progress` varchar(30) NOT NULL,
  `Langitude` double NOT NULL,
  `Latitude` double NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of constructionsite
-- ----------------------------
INSERT INTO `constructionsite` VALUES ('111100', '项目二', '工地名称111', '000111', '1000', '2015-10-10', '2017-10-10', '60', '金水区', '六一街', '建设单位100', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111101', '项目二', '工地名称112', '000112', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位101', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111102', '项目二', '工地名称113', '000113', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位102', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111103', '项目二', '工地名称114', '000114', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位103', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111104', '项目二', '工地名称115', '000115', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位104', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111105', '项目二', '工地名称116', '000116', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位105', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111106', '项目二', '工地名称117', '000117', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位106', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111107', '项目二', '工地名称118', '000118', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位107', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111108', '项目二', '工地名称119', '000119', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位108', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111109', '项目二', '工地名称120', '000120', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位109', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111110', '项目二', '工地名称121', '000121', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位110', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111111', '项目二', '工地名称122', '000122', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位111', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111112', '项目二', '工地名称123', '000123', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位112', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111113', '项目二', '工地名称124', '000124', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位113', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111114', '项目二', '工地名称125', '000125', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位114', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111115', '项目二', '工地名称126', '000126', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位115', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111116', '项目二', '工地名称127', '000127', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位116', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111117', '项目二', '工地名称128', '000128', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位117', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111118', '项目二', '工地名称129', '000129', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位118', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111119', '项目二', '工地名称130', '000130', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位119', '结构', '350000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111120', '项目二', '工地名称131', '000131', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位120', '结构', '350000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111121', '项目二', '工地名称132', '000132', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位121', '结构', '350000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111122', '项目二', '工地名称133', '000133', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位122', '结构', '350000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111123', '项目二', '工地名称134', '000134', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '六一街', '建设单位123', '结构', '350000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111124', '项目一', '工地名称135', '000135', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '五一街', '建设单位124', '结构', '350000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111125', '项目一', '工地名称136', '000136', '1000', '2015-10-10', '2017-10-10', '50', '金水区', '五一街', '建设单位125', '结构', '350000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111126', '项目一', '工地名称137', '000137', '1000', '2015-10-10', '2017-10-10', '50', '二七区', '五一街', '建设单位126', '结构', '350000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111127', '项目一', '工地名称138', '000138', '1000', '2015-10-10', '2017-10-10', '50', '二七区', '五一街', '建设单位127', '结构', '350000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111128', '项目一', '工地名称139', '000139', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位128', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111129', '项目一', '工地名称140', '000140', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位129', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111130', '项目一', '工地名称141', '000141', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位130', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111131', '项目一', '工地名称142', '000142', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位131', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111132', '项目一', '工地名称143', '000143', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位132', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111133', '项目一', '工地名称144', '000144', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位133', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111134', '项目一', '工地名称145', '000145', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位134', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111135', '项目一', '工地名称146', '000146', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位135', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111136', '项目一', '工地名称147', '000147', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位136', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111137', '项目一', '工地名称148', '000148', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位137', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111138', '项目一', '工地名称149', '000149', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位138', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111139', '项目一', '工地名称150', '000150', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位139', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111140', '项目一', '工地名称151', '000151', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位140', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111141', '项目一', '工地名称152', '000152', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位141', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111142', '项目一', '工地名称153', '000153', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位142', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111143', '项目一', '工地名称154', '000154', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位143', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111144', '项目一', '工地名称155', '000155', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位144', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111145', '项目一', '工地名称156', '000156', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位145', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111146', '项目一', '工地名称157', '000157', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位146', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111147', '项目一', '工地名称158', '000158', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位147', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111148', '项目一', '工地名称159', '000159', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位148', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111149', '项目一', '工地名称160', '000160', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '五一街', '建设单位149', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111150', '项目一', '工地名称161', '000161', '2000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位150', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111151', '项目一', '工地名称162', '000162', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位151', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111152', '项目一', '工地名称163', '000163', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位152', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111153', '项目一', '工地名称164', '000164', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位153', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111154', '项目一', '工地名称165', '000165', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位154', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111155', '项目一', '工地名称166', '000166', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位155', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111156', '项目三', '工地名称167', '000167', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位156', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111157', '项目三', '工地名称168', '000168', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位157', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111158', '项目三', '工地名称169', '000169', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位158', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111159', '项目三', '工地名称170', '000170', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位159', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111160', '项目三', '工地名称171', '000171', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位160', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111161', '项目三', '工地名称172', '000172', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位161', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111162', '项目三', '工地名称173', '000173', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位162', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111163', '项目三', '工地名称174', '000174', '1000', '2015-10-10', '2017-10-10', '60', '管城区', '六一街', '建设单位163', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111164', '项目三', '工地名称175', '000175', '1000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位164', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111165', '项目三', '工地名称176', '000176', '1000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位165', '结构', '300000', '10', '完成', '120', '34');
INSERT INTO `constructionsite` VALUES ('111166', '项目三', '工地名称177', '000177', '1000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位166', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111167', '项目三', '工地名称178', '000178', '1000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位167', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111168', '项目三', '工地名称179', '000179', '1000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位168', '结构', '300000', '10', '完成', '120', '35');
INSERT INTO `constructionsite` VALUES ('111169', '项目三', '工地名称180', '000180', '1000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位169', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111170', '项目三', '工地名称181', '000181', '1000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位170', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111171', '项目三', '工地名称182', '000182', '3000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位171', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111172', '项目三', '工地名称183', '000183', '3000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位172', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111173', '项目三', '工地名称184', '000184', '3000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位173', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111174', '项目三', '工地名称185', '000185', '3000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位174', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111175', '项目三', '工地名称186', '000186', '3000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位175', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111176', '项目三', '工地名称187', '000187', '3000', '2015-10-10', '2017-10-10', '30', '管城区', '六一街', '建设单位176', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111177', '项目三', '工地名称188', '000188', '3000', '2015-10-10', '2017-10-10', '30', '管城区', '巴一街', '建设单位177', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111178', '项目三', '工地名称189', '000189', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位178', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111179', '项目三', '工地名称190', '000190', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位179', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111180', '项目三', '工地名称191', '000191', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位180', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111181', '项目三', '工地名称192', '000192', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位181', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111182', '项目一', '工地名称193', '000193', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位182', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111183', '项目一', '工地名称194', '000194', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位183', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111184', '项目一', '工地名称195', '000195', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位184', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111185', '项目一', '工地名称196', '000196', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位185', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111186', '项目一', '工地名称197', '000197', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位186', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111187', '项目一', '工地名称198', '000198', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位187', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111188', '项目一', '工地名称199', '000199', '3000', '2015-10-10', '2017-10-10', '30', '二七区', '巴一街', '建设单位188', '结构', '300000', '10', '在建', '120', '35');
INSERT INTO `constructionsite` VALUES ('111189', '项目一', '工地名称200', '000200', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '巴一街', '建设单位189', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111190', '项目一', '工地名称201', '000201', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '巴一街', '建设单位190', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111191', '项目一', '工地名称202', '000202', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '巴一街', '建设单位191', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111192', '项目一', '工地名称203', '000203', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '巴一街', '建设单位192', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111193', '项目一', '工地名称204', '000204', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '巴一街', '建设单位193', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111194', '项目一', '工地名称205', '000205', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '巴一街', '建设单位194', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111195', '项目一', '工地名称206', '000206', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '巴一街', '建设单位195', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111196', '项目一', '工地名称207', '000207', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位196', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111197', '项目一', '工地名称208', '000208', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位197', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111198', '项目一', '工地名称209', '000209', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位198', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111199', '项目一', '工地名称210', '000210', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位199', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111200', '项目一', '工地名称211', '000211', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位200', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111201', '项目一', '工地名称212', '000212', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位201', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111202', '项目一', '工地名称213', '000213', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位202', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111203', '项目一', '工地名称214', '000214', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位203', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111204', '项目一', '工地名称215', '000215', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位204', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111205', '项目四', '工地名称216', '000216', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位205', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111206', '项目四', '工地名称217', '000217', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位206', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111207', '项目四', '工地名称218', '000218', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位207', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111208', '项目四', '工地名称219', '000219', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位208', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111209', '项目四', '工地名称220', '000220', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位209', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111210', '项目四', '工地名称221', '000221', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位210', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111211', '项目四', '工地名称222', '000222', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位211', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111212', '项目四', '工地名称223', '000223', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位212', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111213', '项目四', '工地名称224', '000224', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位213', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111214', '项目四', '工地名称225', '000225', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位214', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111215', '项目四', '工地名称226', '000226', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位215', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111216', '项目四', '工地名称227', '000227', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位216', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111217', '项目四', '工地名称228', '000228', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位217', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111218', '项目四', '工地名称229', '000229', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位218', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111219', '项目四', '工地名称230', '000230', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位219', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111220', '项目四', '工地名称231', '000231', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位220', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111221', '项目四', '工地名称232', '000232', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位221', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111222', '项目四', '工地名称233', '000233', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位222', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111223', '项目四', '工地名称234', '000234', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位223', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111224', '项目四', '工地名称235', '000235', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位224', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111225', '项目四', '工地名称236', '000236', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位225', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111226', '项目四', '工地名称237', '000237', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位226', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111227', '项目四', '工地名称238', '000238', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位227', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111228', '项目四', '工地名称239', '000239', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位228', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111229', '项目四', '工地名称240', '000240', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位229', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111230', '项目四', '工地名称241', '000241', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位230', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111231', '项目一', '工地名称242', '000242', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位231', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111232', '项目一', '工地名称243', '000243', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位232', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111233', '项目一', '工地名称244', '000244', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位233', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111234', '项目一', '工地名称245', '000245', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位234', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111235', '项目一', '工地名称246', '000246', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位235', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111236', '项目一', '工地名称247', '000247', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位236', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111237', '项目一', '工地名称248', '000248', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位237', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111238', '项目一', '工地名称249', '000249', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '秋实街', '建设单位238', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111239', '项目一', '工地名称250', '000250', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位239', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111240', '项目一', '工地名称251', '000251', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位240', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111241', '项目一', '工地名称252', '000252', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位241', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111242', '项目一', '工地名称253', '000253', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位242', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111243', '项目一', '工地名称254', '000254', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位243', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111244', '项目一', '工地名称255', '000255', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位244', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111245', '项目一', '工地名称256', '000256', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位245', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111246', '项目一', '工地名称257', '000257', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位246', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111247', '项目一', '工地名称258', '000258', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位247', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111248', '项目一', '工地名称259', '000259', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位248', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111249', '项目一', '工地名称260', '000260', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位249', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111250', '项目一', '工地名称261', '000261', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位250', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111251', '项目一', '工地名称262', '000262', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位251', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111252', '项目一', '工地名称263', '000263', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位252', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111253', '项目一', '工地名称264', '000264', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位253', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111254', '项目一', '工地名称265', '000265', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位254', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111255', '项目一', '工地名称266', '000266', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位255', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111256', '项目一', '工地名称267', '000267', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位256', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111257', '项目一', '工地名称268', '000268', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位257', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111258', '项目一', '工地名称269', '000269', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位258', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111259', '项目一', '工地名称270', '000270', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位259', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111260', '项目一', '工地名称271', '000271', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位260', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111261', '项目一', '工地名称272', '000272', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位261', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111262', '项目一', '工地名称273', '000273', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位262', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111263', '项目一', '工地名称274', '000274', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位263', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111264', '项目一', '工地名称275', '000275', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位264', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111265', '项目一', '工地名称276', '000276', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位265', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111266', '项目一', '工地名称277', '000277', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位266', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111267', '项目一', '工地名称278', '000278', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位267', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111268', '项目一', '工地名称279', '000279', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位268', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111269', '项目一', '工地名称280', '000280', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位269', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111270', '项目一', '工地名称281', '000281', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位270', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111271', '项目一', '工地名称282', '000282', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位271', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111272', '项目一', '工地名称283', '000283', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位272', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111273', '项目一', '工地名称284', '000284', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位273', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111274', '项目一', '工地名称285', '000285', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位274', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111275', '项目一', '工地名称286', '000286', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位275', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111276', '项目一', '工地名称287', '000287', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位276', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111277', '项目一', '工地名称288', '000288', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位277', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111278', '项目一', '工地名称289', '000289', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位278', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111279', '项目一', '工地名称290', '000290', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位279', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111280', '项目一', '工地名称291', '000291', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位280', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111281', '项目一', '工地名称292', '000292', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位281', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111282', '项目一', '工地名称293', '000293', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位282', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111283', '项目一', '工地名称294', '000294', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位283', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111284', '项目一', '工地名称295', '000295', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位284', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111285', '项目一', '工地名称296', '000296', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位285', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111286', '项目一', '工地名称297', '000297', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位286', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111287', '项目一', '工地名称298', '000298', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位287', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111288', '项目一', '工地名称299', '000299', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位288', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111289', '项目一', '工地名称300', '000300', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位289', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111290', '项目一', '工地名称301', '000301', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位290', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111291', '项目一', '工地名称302', '000302', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位291', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111292', '项目一', '工地名称303', '000303', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位292', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111293', '项目一', '工地名称304', '000304', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位293', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111294', '项目一', '工地名称305', '000305', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位294', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111295', '项目一', '工地名称306', '000306', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位295', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111296', '项目一', '工地名称307', '000307', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位296', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111297', '项目一', '工地名称308', '000308', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位297', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111298', '项目一', '工地名称309', '000309', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位298', '结构', '300000', '10', '在建', '120', '34');
INSERT INTO `constructionsite` VALUES ('111299', '项目一', '工地名称310', '000310', '1000', '2015-10-10', '2017-10-10', '60', '二七区', '六一街', '建设单位299', '结构', '300000', '10', '在建', '120', '34');

-- ----------------------------
-- Table structure for `constructionsitedirector`
-- ----------------------------
DROP TABLE IF EXISTS `constructionsitedirector`;
CREATE TABLE `constructionsitedirector` (
  `ID` varchar(30) NOT NULL,
  `Password` varchar(20) NOT NULL,
  `Name` varchar(30) NOT NULL,
  `Sex` char(4) NOT NULL DEFAULT '男',
  `Tel` varchar(20) NOT NULL,
  `IDcardNO` varchar(30) NOT NULL,
  `ConstructionSiteID` varchar(50) NOT NULL,
  `Company` varchar(50) NOT NULL,
  `RegisterTime` date NOT NULL,
  `LogoffTime` date NOT NULL,
  PRIMARY KEY (`ID`),
  UNIQUE KEY `IDcardNO` (`IDcardNO`),
  KEY `ConDir_ConSite_FK` (`ConstructionSiteID`),
  CONSTRAINT `ConDir_ConSite_FK` FOREIGN KEY (`ConstructionSiteID`) REFERENCES `constructionsite` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of constructionsitedirector
-- ----------------------------
INSERT INTO `constructionsitedirector` VALUES ('000111', 'admin', 'admin', '男', '15567000000', '422112196809121100', '111100', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000112', '111', '和先生', '男', '15567000000', '422112196809121101', '111101', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000113', '111', '和先生', '男', '15567000000', '422112196809121102', '111102', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000114', '111', '和先生', '男', '15567000000', '422112196809121103', '111103', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000115', '111', '和先生', '男', '15567000000', '422112196809121104', '111104', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000116', '111', '和先生', '男', '15567000000', '422112196809121105', '111105', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000117', '111', '和先生', '男', '15567000000', '422112196809121106', '111106', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000118', '111', '和先生', '男', '15567000000', '422112196809121107', '111107', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000119', '111', '和先生', '男', '15567000000', '422112196809121108', '111108', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000120', '111', '和先生', '男', '15567000000', '422112196809121109', '111109', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000121', '111', '和先生', '男', '15567000000', '422112196809121110', '111110', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000122', '111', '和先生', '男', '15567000000', '422112196809121111', '111111', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000123', '111', '和先生', '男', '15567000000', '422112196809121112', '111112', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000124', '111', '和先生', '男', '15567000000', '422112196809121113', '111113', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000125', '111', '和先生', '男', '15567000000', '422112196809121114', '111114', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000126', '111', '和先生', '男', '15567000000', '422112196809121115', '111115', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000127', '111', '和先生', '男', '15567000000', '422112196809121116', '111116', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000128', '111', '和先生', '男', '15567000000', '422112196809121117', '111117', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000129', '111', '和先生', '男', '15567000000', '422112196809121118', '111118', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000130', '111', '和先生', '男', '15567000000', '422112196809121119', '111119', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000131', '111', '和先生', '男', '15567000000', '422112196809121120', '111120', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000132', '111', '和先生', '男', '15567000000', '422112196809121121', '111121', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000133', '111', '李先生', '男', '15567000000', '422112196809121122', '111122', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000134', '111', '李先生', '男', '15567000000', '422112196809121123', '111123', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000135', '111', '李先生', '男', '15567000000', '422112196809121124', '111124', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000136', '111', '李先生', '男', '15500000000', '422112196809121125', '111125', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000137', '111', '李先生', '男', '15500000000', '422112196809121126', '111126', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000138', '111', '李先生', '男', '15500000000', '422112196809121127', '111127', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000139', '111', '李先生', '男', '15500000000', '422112196809121128', '111128', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000140', '111', '张先生', '男', '15500000000', '422112196809121129', '111129', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000141', '111', '张先生', '男', '15500000000', '422112196809121130', '111130', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000142', '111', '张先生', '男', '15500000000', '422112196809121131', '111131', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000143', '111', '张先生', '男', '15500000000', '422112196809121132', '111132', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000144', '111', '张先生', '男', '15500000000', '422112196809121133', '111133', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000145', '111', '张先生', '男', '15500000000', '422112196809121134', '111134', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000146', '111', '张先生', '男', '15500000000', '422112196809121135', '111135', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000147', '111', '张先生', '男', '15500000000', '422112196809121136', '111136', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000148', '111', '张先生', '男', '15500000000', '422112196809121137', '111137', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000149', '111', '张先生', '男', '15500000000', '422112196809121138', '111138', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000150', '111', '张先生', '男', '15500000000', '422112196809121139', '111139', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000151', '111', '张先生', '男', '15500000000', '422112196809121140', '111140', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000152', '111', '张先生', '男', '15500000000', '422112196809121141', '111141', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000153', '111', '张先生', '男', '15500000000', '422112196809121142', '111142', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000154', '111', '张先生', '男', '15500000000', '422112196809121143', '111143', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000155', '111', '张先生', '男', '15500000000', '422112196809121144', '111144', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000156', '111', '张先生', '男', '15500000000', '422112196809121145', '111145', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000157', '111', '张先生', '男', '15500000000', '422112196809121146', '111146', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000158', '111', '张先生', '男', '15500000000', '422112196809121147', '111147', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000159', '111', '张先生', '男', '15500000000', '422112196809121148', '111148', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000160', '111', '张先生', '男', '15500000000', '422112196809121149', '111149', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000161', '111', '张先生', '男', '15500000000', '422112196809121150', '111150', '建设公司', '0000-00-00', '0000-00-00');
INSERT INTO `constructionsitedirector` VALUES ('000162', '111', '张先生', '男', '15500000000', '422112196809121151', '111151', '建设公司', '0000-00-00', '0000-00-00');

-- ----------------------------
-- Table structure for `correctionnotification`
-- ----------------------------
DROP TABLE IF EXISTS `correctionnotification`;
CREATE TABLE `correctionnotification` (
  `ID` varchar(30) NOT NULL,
  `Title` varchar(50) NOT NULL,
  `Content` text NOT NULL,
  `Department` varchar(50) NOT NULL,
  `According` varchar(50) NOT NULL,
  `HasImg` bit(1) NOT NULL,
  `HasVideo` bit(1) NOT NULL,
  `HasText` bit(1) NOT NULL,
  `ImgPath` text NOT NULL,
  `VideoPath` text NOT NULL,
  `PublishTime` date NOT NULL,
  `UpToTime` date NOT NULL,
  `IsFeedback` bit(1) NOT NULL,
  `ConSiteID` varchar(50) NOT NULL,
  `FeedbackID` varchar(50) NOT NULL,
  `Status` smallint(1) NOT NULL,
  PRIMARY KEY (`ID`),
  UNIQUE KEY `FeedbackID` (`FeedbackID`),
  KEY `Notification_ConSite_FK` (`ConSiteID`),
  CONSTRAINT `Notification_ConSite_FK` FOREIGN KEY (`ConSiteID`) REFERENCES `constructionsite` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of correctionnotification
-- ----------------------------
INSERT INTO `correctionnotification` VALUES ('777100', '整改标题100', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111100', '888100', '0');
INSERT INTO `correctionnotification` VALUES ('777101', '整改标题101', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111101', '888101', '0');
INSERT INTO `correctionnotification` VALUES ('777102', '整改标题102', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111102', '888102', '0');
INSERT INTO `correctionnotification` VALUES ('777103', '整改标题103', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111103', '888103', '0');
INSERT INTO `correctionnotification` VALUES ('777104', '整改标题104', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111104', '888104', '0');
INSERT INTO `correctionnotification` VALUES ('777105', '整改标题105', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111105', '888105', '0');
INSERT INTO `correctionnotification` VALUES ('777106', '整改标题106', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111106', '888106', '0');
INSERT INTO `correctionnotification` VALUES ('777107', '整改标题107', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111107', '888107', '0');
INSERT INTO `correctionnotification` VALUES ('777108', '整改标题108', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111108', '888108', '0');
INSERT INTO `correctionnotification` VALUES ('777109', '整改标题109', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111109', '888109', '0');
INSERT INTO `correctionnotification` VALUES ('777110', '整改标题110', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111110', '888110', '0');
INSERT INTO `correctionnotification` VALUES ('777111', '整改标题111', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111111', '888111', '0');
INSERT INTO `correctionnotification` VALUES ('777112', '整改标题112', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111112', '888112', '0');
INSERT INTO `correctionnotification` VALUES ('777113', '整改标题113', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111113', '888113', '0');
INSERT INTO `correctionnotification` VALUES ('777114', '整改标题114', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111114', '888114', '0');
INSERT INTO `correctionnotification` VALUES ('777115', '整改标题115', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111115', '888115', '0');
INSERT INTO `correctionnotification` VALUES ('777116', '整改标题116', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111116', '888116', '0');
INSERT INTO `correctionnotification` VALUES ('777117', '整改标题117', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111117', '888117', '0');
INSERT INTO `correctionnotification` VALUES ('777118', '整改标题118', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111118', '888118', '0');
INSERT INTO `correctionnotification` VALUES ('777119', '整改标题119', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111119', '888119', '0');
INSERT INTO `correctionnotification` VALUES ('777120', '整改标题120', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111120', '888120', '0');
INSERT INTO `correctionnotification` VALUES ('777121', '整改标题121', '整改内容', '管理中心', '微信投诉', '\0', '', '', '', '', '2015-11-01', '2015-11-10', '', '111121', '888121', '0');
INSERT INTO `correctionnotification` VALUES ('777122', '整改标题122', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111122', '888122', '0');
INSERT INTO `correctionnotification` VALUES ('777123', '整改标题123', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111123', '888123', '0');
INSERT INTO `correctionnotification` VALUES ('777124', '整改标题124', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111124', '888124', '0');
INSERT INTO `correctionnotification` VALUES ('777125', '整改标题125', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111125', '888125', '0');
INSERT INTO `correctionnotification` VALUES ('777126', '整改标题126', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111126', '888126', '0');
INSERT INTO `correctionnotification` VALUES ('777127', '整改标题127', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111127', '888127', '0');
INSERT INTO `correctionnotification` VALUES ('777128', '整改标题128', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111128', '888128', '0');
INSERT INTO `correctionnotification` VALUES ('777129', '整改标题129', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111129', '888129', '0');
INSERT INTO `correctionnotification` VALUES ('777130', '整改标题130', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111130', '888130', '0');
INSERT INTO `correctionnotification` VALUES ('777131', '整改标题131', '整改内容', '管理中心', '微信投诉', '\0', '', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111131', '888131', '0');
INSERT INTO `correctionnotification` VALUES ('777132', '整改标题132', '整改内容', '管理中心', '微信投诉', '\0', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111132', '888132', '0');
INSERT INTO `correctionnotification` VALUES ('777133', '整改标题133', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111133', '888133', '0');
INSERT INTO `correctionnotification` VALUES ('777134', '整改标题134', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111134', '888134', '0');
INSERT INTO `correctionnotification` VALUES ('777135', '整改标题135', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111135', '888135', '0');
INSERT INTO `correctionnotification` VALUES ('777136', '整改标题136', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111136', '888136', '0');
INSERT INTO `correctionnotification` VALUES ('777137', '整改标题137', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111137', '888137', '0');
INSERT INTO `correctionnotification` VALUES ('777138', '整改标题138', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111138', '888138', '0');
INSERT INTO `correctionnotification` VALUES ('777139', '整改标题139', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111139', '888139', '0');
INSERT INTO `correctionnotification` VALUES ('777140', '整改标题140', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111140', '888140', '0');
INSERT INTO `correctionnotification` VALUES ('777141', '整改标题141', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111141', '888141', '0');
INSERT INTO `correctionnotification` VALUES ('777142', '整改标题142', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111142', '888142', '0');
INSERT INTO `correctionnotification` VALUES ('777143', '整改标题143', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111143', '888143', '0');
INSERT INTO `correctionnotification` VALUES ('777144', '整改标题144', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111144', '888144', '0');
INSERT INTO `correctionnotification` VALUES ('777145', '整改标题145', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111145', '888145', '0');
INSERT INTO `correctionnotification` VALUES ('777146', '整改标题146', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111146', '888146', '0');
INSERT INTO `correctionnotification` VALUES ('777147', '整改标题147', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111147', '888147', '0');
INSERT INTO `correctionnotification` VALUES ('777148', '整改标题148', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111148', '888148', '0');
INSERT INTO `correctionnotification` VALUES ('777149', '整改标题149', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111149', '888149', '0');
INSERT INTO `correctionnotification` VALUES ('777150', '整改标题150', '整改内容', '管理中心', '微信投诉', '', '\0', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111150', '888150', '0');
INSERT INTO `correctionnotification` VALUES ('777151', '整改标题151', '整改内容', '管理中心', '微信投诉', '', '', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111151', '888151', '0');
INSERT INTO `correctionnotification` VALUES ('777152', '整改标题152', '整改内容', '管理中心', '微信投诉', '', '', '\0', '', '', '2015-11-01', '2015-11-10', '\0', '111152', '888152', '0');
INSERT INTO `correctionnotification` VALUES ('777153', '整改标题153', '整改内容', '管理中心', '微信投诉', '', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111153', '888153', '0');
INSERT INTO `correctionnotification` VALUES ('777154', '整改标题154', '整改内容', '管理中心', '微信投诉', '', '', '\0', '', '', '2015-11-01', '2015-11-10', '', '111154', '888154', '0');
INSERT INTO `correctionnotification` VALUES ('777155', '整改标题155', '整改内容', '管理中心', '微信投诉', '', '', '', '', '', '2015-11-01', '2015-11-10', '', '111155', '888155', '0');
INSERT INTO `correctionnotification` VALUES ('777156', '整改标题156', '整改内容', '管理中心', '微信投诉', '', '', '', '', '', '2015-11-01', '2015-11-10', '', '111156', '888156', '0');
INSERT INTO `correctionnotification` VALUES ('777157', '整改标题157', '整改内容', '管理中心', '微信投诉', '', '', '', '', '', '2015-11-01', '2015-11-10', '', '111157', '888157', '0');
INSERT INTO `correctionnotification` VALUES ('777158', '整改标题158', '整改内容', '管理中心', '微信投诉', '', '', '', '', '', '2015-11-01', '2015-11-10', '', '111158', '888158', '0');
INSERT INTO `correctionnotification` VALUES ('777159', '整改标题159', '整改内容', '管理中心', '微信投诉', '', '', '', '', '', '2015-11-01', '2015-11-10', '', '111159', '888159', '0');
INSERT INTO `correctionnotification` VALUES ('777160', '整改标题160', '整改内容', '管理中心', '微信投诉', '', '', '', '', '', '2015-11-01', '2015-11-10', '', '111160', '888160', '0');
INSERT INTO `correctionnotification` VALUES ('777161', '整改标题161', '整改内容', '管理中心', '微信投诉', '', '', '', '', '', '2015-11-01', '2015-11-10', '', '111161', '888161', '0');
INSERT INTO `correctionnotification` VALUES ('777162', '整改标题162', '整改内容', '管理中心', '微信投诉', '', '', '', '', '', '2015-11-01', '2015-11-10', '', '111162', '888162', '0');

-- ----------------------------
-- Table structure for `customercomplaint`
-- ----------------------------
DROP TABLE IF EXISTS `customercomplaint`;
CREATE TABLE `customercomplaint` (
  `ID` varchar(30) NOT NULL,
  `WeChatNO` varchar(30) NOT NULL,
  `Districts` varchar(50) NOT NULL,
  `Streets` varchar(50) NOT NULL,
  `ConSiteID` varchar(30) NOT NULL,
  `Contents` text NOT NULL,
  `HasImg` smallint(1) NOT NULL,
  `HasVideo` smallint(1) NOT NULL,
  `Status` smallint(1) NOT NULL,
  `ComplainTime` date NOT NULL,
  `DealedTime` date NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `ConSite_CusComplaint_FK` (`ConSiteID`),
  CONSTRAINT `ConSite_CusComplaint_FK` FOREIGN KEY (`ConSiteID`) REFERENCES `constructionsite` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of customercomplaint
-- ----------------------------
INSERT INTO `customercomplaint` VALUES ('1450087462273', 'weChatNo', '金水区', '六一街', '111124', 'qwweq', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333100', 'weixin111', '管城区', '解放街', '111123', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333101', 'weixin112', '管城区', '解放街', '111124', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333102', 'weixin113', '管城区', '解放街', '111125', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333103', 'weixin114', '管城区', '解放街', '111126', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333104', 'weixin115', '管城区', '解放街', '111127', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333105', 'weixin116', '管城区', '解放街', '111128', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333106', 'weixin117', '管城区', '解放街', '111129', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333107', 'weixin118', '管城区', '解放街', '111130', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333108', 'weixin119', '管城区', '解放街', '111131', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333109', 'weixin120', '管城区', '解放街', '111132', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333110', 'weixin121', '管城区', '解放街', '111133', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333111', 'weixin122', '管城区', '解放街', '111134', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333112', 'weixin123', '管城区', '解放街', '111135', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333113', 'weixin124', '管城区', '解放街', '111136', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333114', 'weixin125', '管城区', '解放街', '111137', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333135', 'weixin146', '二七区', '八一街', '111158', '噪音很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333136', 'weixin147', '二七区', '八一街', '111159', '噪音很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333137', 'weixin148', '二七区', '八一街', '111160', '噪音很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333138', 'weixin149', '二七区', '八一街', '111161', '噪音很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333139', 'weixin150', '二七区', '八一街', '111162', '噪音很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333140', 'weixin151', '二七区', '八一街', '111163', '噪音很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333141', 'weixin152', '二七区', '八一街', '111164', '噪音很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333142', 'weixin153', '二七区', '八一街', '111165', '噪音很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333143', 'weixin154', '二七区', '八一街', '111166', '噪音很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333144', 'weixin155', '二七区', '八一街', '111167', '噪音很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333145', 'weixin156', '金水区', '八一街', '111168', '噪音很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333146', 'weixin157', '金水区', '八一街', '111169', '噪音很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333147', 'weixin158', '金水区', '八一街', '111170', '噪音很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333148', 'weixin159', '金水区', '八一街', '111171', '噪音很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333149', 'weixin160', '金水区', '八一街', '111172', '灰尘很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333150', 'weixin161', '金水区', '八一街', '111173', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333151', 'weixin162', '金水区', '八一街', '111174', '灰尘很大', '1', '0', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333152', 'weixin163', '金水区', '八一街', '111175', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333153', 'weixin164', '金水区', '八一街', '111176', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333154', 'weixin165', '金水区', '八一街', '111177', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333155', 'weixin166', '金水区', '八一街', '111178', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333156', 'weixin167', '金水区', '八一街', '111179', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333157', 'weixin168', '二七区', '八一街', '111180', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333158', 'weixin169', '二七区', '八一街', '111181', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333159', 'weixin170', '二七区', '八一街', '111182', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333160', 'weixin171', '二七区', '八一街', '111183', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333161', 'weixin172', '二七区', '八一街', '111184', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333162', 'weixin173', '二七区', '八一街', '111185', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333163', 'weixin174', '二七区', '八一街', '111186', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333164', 'weixin175', '二七区', '八一街', '111187', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333165', 'weixin176', '二七区', '八一街', '111188', '灰尘很大', '1', '0', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333166', 'weixin177', '东区', '八一街', '111189', '灰尘很大', '1', '0', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333167', 'weixin178', '东区', '八一街', '111190', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333168', 'weixin179', '东区', '八一街', '111191', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333169', 'weixin180', '东区', '八一街', '111192', '灰尘很大', '1', '0', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333170', 'weixin181', '东区', '八一街', '111193', '灰尘很大', '1', '0', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333171', 'weixin182', '东区', '八一街', '111194', '灰尘很大', '1', '0', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333172', 'weixin183', '东区', '八一街', '111195', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333173', 'weixin184', '东区', '八一街', '111196', '灰尘很大', '1', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333174', 'weixin185', '东区', '八一街', '111197', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333175', 'weixin186', '东区', '八一街', '111198', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333176', 'weixin187', '东区', '八一街', '111199', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333177', 'weixin188', '东区', '八一街', '111200', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333178', 'weixin189', '东区', '八一街', '111201', '灰尘很大', '0', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333179', 'weixin190', '东区', '八一街', '111202', '灰尘很大', '0', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333180', 'weixin191', '东区', '八一街', '111203', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333181', 'weixin192', '东区', '八一街', '111204', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333182', 'weixin193', '东区', '八一街', '111205', '灰尘很大', '0', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333183', 'weixin194', '东区', '八一街', '111206', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333184', 'weixin195', '东区', '八一街', '111207', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333185', 'weixin196', '二七区', '八一街', '111208', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333186', 'weixin197', '二七区', '八一街', '111209', '灰尘很大', '0', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333187', 'weixin198', '二七区', '八一街', '111210', '灰尘很大', '0', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333188', 'weixin199', '二七区', '八一街', '111211', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333189', 'weixin200', '二七区', '八一街', '111212', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333190', 'weixin201', '二七区', '八一街', '111213', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333191', 'weixin202', '二七区', '八一街', '111214', '灰尘很大', '0', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333192', 'weixin203', '二七区', '八一街', '111215', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333193', 'weixin204', '二七区', '八一街', '111216', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333194', 'weixin205', '二七区', '八一街', '111217', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333195', 'weixin206', '二七区', '八一街', '111218', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333196', 'weixin207', '二七区', '八一街', '111219', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333197', 'weixin208', '二七区', '八一街', '111220', '灰尘很大', '1', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333198', 'weixin209', '二七区', '八一街', '111221', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333199', 'weixin210', '二七区', '八一街', '111222', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333200', 'weixin211', '二七区', '八一街', '111223', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333201', 'weixin212', '二七区', '八一街', '111224', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333202', 'weixin213', '二七区', '八一街', '111225', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333203', 'weixin214', '二七区', '八一街', '111226', '灰尘很大', '1', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333204', 'weixin215', '二七区', '八一街', '111227', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333205', 'weixin216', '二七区', '八一街', '111228', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333206', 'weixin217', '二七区', '八一街', '111229', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333207', 'weixin218', '二七区', '八一街', '111230', '灰尘很大', '1', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333208', 'weixin219', '二七区', '八一街', '111231', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333209', 'weixin220', '二七区', '八一街', '111232', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333210', 'weixin221', '二七区', '八一街', '111233', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333211', 'weixin222', '二七区', '八一街', '111234', '灰尘很大', '1', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333212', 'weixin223', '二七区', '八一街', '111235', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333213', 'weixin224', '二七区', '八一街', '111236', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333214', 'weixin225', '二七区', '八一街', '111237', '灰尘很大', '1', '1', '2', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333215', 'weixin226', '二七区', '八一街', '111238', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333216', 'weixin227', '二七区', '八一街', '111239', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333217', 'weixin228', '二七区', '八一街', '111240', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333218', 'weixin229', '北区', '八一街', '111241', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333219', 'weixin230', '北区', '八一街', '111242', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333220', 'weixin231', '北区', '八一街', '111243', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333221', 'weixin232', '北区', '八一街', '111244', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333222', 'weixin233', '北区', '八一街', '111245', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333223', 'weixin234', '北区', '八一街', '111246', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333224', 'weixin235', '北区', '八一街', '111247', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333225', 'weixin236', '北区', '八一街', '111248', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333226', 'weixin237', '北区', '八一街', '111249', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333227', 'weixin238', '北区', '八一街', '111250', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333228', 'weixin239', '北区', '八一街', '111251', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333229', 'weixin240', '北区', '八一街', '111252', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333230', 'weixin241', '北区', '八一街', '111253', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333231', 'weixin242', '北区', '八一街', '111254', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333232', 'weixin243', '北区', '八一街', '111255', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333233', 'weixin244', '北区', '八一街', '111256', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333234', 'weixin245', '北区', '八一街', '111257', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333235', 'weixin246', '北区', '八一街', '111258', '灰尘很大', '1', '1', '1', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333236', 'weixin247', '北区', '八一街', '111259', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333237', 'weixin248', '北区', '八一街', '111260', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');
INSERT INTO `customercomplaint` VALUES ('333238', 'weixin249', '北区', '八一街', '111261', '灰尘很大', '1', '1', '0', '0000-00-00', '0000-00-00');

-- ----------------------------
-- Table structure for `fineticket`
-- ----------------------------
DROP TABLE IF EXISTS `fineticket`;
CREATE TABLE `fineticket` (
  `ID` varchar(30) NOT NULL,
  `NotificationID` varchar(30) DEFAULT NULL,
  `ConSiteID` varchar(30) DEFAULT NULL,
  `Company` varchar(50) NOT NULL,
  `FineMoney` double NOT NULL,
  `StartTime` date NOT NULL,
  `DeadLine` date NOT NULL,
  `Who` varchar(30) NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `Fine_Notification_FK` (`NotificationID`),
  KEY `Fine_ConSite_FK` (`ConSiteID`),
  CONSTRAINT `Fine_ConSite_FK` FOREIGN KEY (`ConSiteID`) REFERENCES `constructionsite` (`ID`),
  CONSTRAINT `Fine_Notification_FK` FOREIGN KEY (`NotificationID`) REFERENCES `correctionnotification` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of fineticket
-- ----------------------------
INSERT INTO `fineticket` VALUES ('666100', '777100', '111100', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666101', '777101', '111101', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666102', '777102', '111102', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666103', '777103', '111103', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666104', '777104', '111104', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666105', '777105', '111105', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666106', '777106', '111106', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666107', '777107', '111107', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666108', '777108', '111108', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666109', '777109', '111109', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666110', '777110', '111110', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666111', '777111', '111111', '施工单位一', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666112', '777112', '111112', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666113', '777113', '111113', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666114', '777114', '111114', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666115', '777115', '111115', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666116', '777116', '111116', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666117', '777117', '111117', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666118', '777118', '111118', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666119', '777119', '111119', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666120', '777120', '111120', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666121', '777121', '111121', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666122', '777122', '111122', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666123', '777123', '111123', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666124', '777124', '111124', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666125', '777125', '111125', '施工单位二', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666126', '777126', '111126', '施工单位三', '2000', '2015-11-01', '2015-11-07', '林先生');
INSERT INTO `fineticket` VALUES ('666127', '777127', '111127', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666128', '777128', '111128', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666129', '777129', '111129', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666130', '777130', '111130', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666131', '777131', '111131', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666132', '777132', '111132', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666133', '777133', '111133', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666134', '777134', '111134', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666135', '777135', '111135', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666136', '777136', '111136', '施工单位三', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666137', '777137', '111137', '施工单位四', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666138', '777138', '111138', '施工单位四', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666139', '777139', '111139', '施工单位四', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666140', '777140', '111140', '施工单位四', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666141', '777141', '111141', '施工单位四', '2000', '2015-11-01', '2015-11-07', '钱先生');
INSERT INTO `fineticket` VALUES ('666142', '777142', '111142', '施工单位四', '2000', '2015-11-01', '2015-11-07', '钱先生');

-- ----------------------------
-- Table structure for `images`
-- ----------------------------
DROP TABLE IF EXISTS `images`;
CREATE TABLE `images` (
  `ImageId` varchar(30) NOT NULL,
  `ComplaintId` varchar(30) NOT NULL,
  `ImgPath` text NOT NULL,
  PRIMARY KEY (`ImageId`),
  KEY `Img_Complaint_FK` (`ComplaintId`),
  CONSTRAINT `Img_Complaint_FK` FOREIGN KEY (`ComplaintId`) REFERENCES `customercomplaint` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of images
-- ----------------------------

-- ----------------------------
-- Table structure for `inspectionpersonnel`
-- ----------------------------
DROP TABLE IF EXISTS `inspectionpersonnel`;
CREATE TABLE `inspectionpersonnel` (
  `ID` varchar(30) NOT NULL,
  `Password` varchar(30) NOT NULL,
  `Name` varchar(30) NOT NULL,
  `Sex` char(4) NOT NULL DEFAULT '男',
  `Section` varchar(30) NOT NULL,
  `Precinct` varchar(50) NOT NULL,
  `Tel` varchar(20) NOT NULL,
  `IDcardNO` varchar(30) NOT NULL,
  `RegisterTime` date NOT NULL,
  `LogoffTime` date NOT NULL,
  PRIMARY KEY (`ID`),
  UNIQUE KEY `IDcardNO` (`IDcardNO`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of inspectionpersonnel
-- ----------------------------
INSERT INTO `inspectionpersonnel` VALUES ('555100', 'admin', 'admin', '男', '巡检一科', '二七区', '13400000000', '4232232197506061100', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555101', '111', '王先生', '男', '巡检一科', '二七区', '13400000000', '4232232197506061101', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555102', '111', '王先生', '男', '巡检一科', '二七区', '13400000000', '4232232197506061102', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555103', '111', '王先生', '男', '巡检一科', '二七区', '13400000000', '4232232197506061103', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555104', '111', '王先生', '男', '巡检一科', '二七区', '13400000000', '4232232197506061104', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555105', '111', '王先生', '男', '巡检一科', '二七区', '13400000000', '4232232197506061105', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555106', '111', '王先生', '男', '巡检一科', '二七区', '13400000000', '4232232197506061106', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555107', '111', '李先生', '男', '巡检一科', '二七区', '13400000000', '4232232197506061107', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555108', '111', '李先生', '男', '巡检一科', '管城区', '13400000000', '4232232197506061108', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555109', '111', '李先生', '男', '巡检一科', '管城区', '13400000000', '4232232197506061109', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555110', '111', '李先生', '男', '巡检一科', '管城区', '13400000000', '4232232197506061110', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555111', '111', '李先生', '男', '巡检一科', '管城区', '13400000000', '4232232197506061111', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555112', '111', '李先生', '男', '巡检一科', '管城区', '13400000000', '4232232197506061112', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555113', '111', '李先生', '男', '巡检一科', '管城区', '13400000000', '4232232197506061113', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555114', '111', '李先生', '男', '巡检二科', '管城区', '13400000000', '4232232197506061114', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555115', '111', '李先生', '男', '巡检二科', '管城区', '13400000000', '4232232197506061115', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555116', '111', '李先生', '男', '巡检二科', '管城区', '13400000000', '4232232197506061116', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555117', '111', '李先生', '男', '巡检二科', '二七区', '13400000000', '4232232197506061117', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555118', '111', '王先生', '男', '巡检二科', '二七区', '13400000000', '4232232197506061118', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555119', '111', '王先生', '男', '巡检二科', '二七区', '13400000000', '4232232197506061119', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555120', '111', '王先生', '男', '巡检二科', '新区', '13400000000', '4232232197506061120', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555121', '111', '王先生', '男', '巡检二科', '新区', '13400000000', '4232232197506061121', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555122', '111', '王先生', '男', '巡检二科', '新区', '13400000000', '4232232197506061122', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555123', '111', '王先生', '男', '巡检二科', '新区', '13400000000', '4232232197506061123', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555124', '111', '王先生', '男', '巡检二科', '二七区', '13400000000', '4232232197506061124', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555125', '111', '王先生', '男', '巡检二科', '二七区', '13400000000', '4232232197506061125', '0000-00-00', '0000-00-00');
INSERT INTO `inspectionpersonnel` VALUES ('555126', '111', '王先生', '男', '巡检二科', '二七区', '13400000000', '4232232197506061126', '0000-00-00', '0000-00-00');

-- ----------------------------
-- Table structure for `lawenforcing`
-- ----------------------------
DROP TABLE IF EXISTS `lawenforcing`;
CREATE TABLE `lawenforcing` (
  `ID` varchar(30) NOT NULL,
  `Password` varchar(30) NOT NULL,
  `Name` varchar(30) NOT NULL,
  `Tel` varchar(20) NOT NULL,
  `IDcardNO` varchar(30) NOT NULL,
  `RegisterTime` date NOT NULL,
  `LogoffTime` date NOT NULL,
  PRIMARY KEY (`ID`),
  UNIQUE KEY `IDcardNO` (`IDcardNO`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of lawenforcing
-- ----------------------------
INSERT INTO `lawenforcing` VALUES ('00010', 'admin', 'admin', '18811111111', '412232197808082111', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00011', '111', '张先生', '18811111111', '412232197808082112', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00012', '111', '张先生', '18811111111', '412232197808082113', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00013', '111', '张先生', '18811111111', '412232197808082114', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00014', '111', '张先生', '18811111111', '412232197808082115', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00015', '111', '张先生', '18811111111', '412232197808082116', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00016', '111', '张先生', '18811111111', '412232197808082117', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00017', '111', '张先生', '18811111111', '412232197808082118', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00018', '111', '张先生', '18811111111', '412232197808082119', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00019', '111', '张先生', '18811111111', '412232197808082120', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00020', '111', '张先生', '18811111111', '412232197808082121', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00021', '111', '张先生', '18811111111', '412232197808082122', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00022', '111', '张先生', '18811111111', '412232197808082123', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00023', '111', '李先生', '18811111111', '412232197808082124', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00024', '111', '李先生', '18811111111', '412232197808082125', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00025', '111', '李先生', '18811111111', '412232197808082126', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00026', '111', '李先生', '18811111111', '412232197808082127', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00027', '111', '李先生', '18811111111', '412232197808082128', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00028', '111', '李先生', '18811111111', '412232197808082129', '0000-00-00', '0000-00-00');
INSERT INTO `lawenforcing` VALUES ('00029', '111', '李先生', '18811111111', '412232197808082130', '0000-00-00', '0000-00-00');

-- ----------------------------
-- Table structure for `tasklist`
-- ----------------------------
DROP TABLE IF EXISTS `tasklist`;
CREATE TABLE `tasklist` (
  `ID` varchar(30) NOT NULL,
  `Source` varchar(50) NOT NULL,
  `Content` text NOT NULL,
  `HasText` tinyint(1) NOT NULL,
  `HasImg` tinyint(1) NOT NULL,
  `HasVideo` tinyint(1) NOT NULL,
  `Status` smallint(1) NOT NULL,
  `CreateTime` date NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tasklist
-- ----------------------------
INSERT INTO `tasklist` VALUES ('999100', '巡检检查', '业务具体内容', '0', '1', '1', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999101', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999102', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999103', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999104', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999105', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999106', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999107', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999108', '巡检检查', '业务具体内容', '0', '1', '1', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999109', '巡检检查', '业务具体内容', '0', '1', '1', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999110', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999111', '巡检检查', '业务具体内容', '0', '1', '1', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999112', '巡检检查', '业务具体内容', '0', '1', '1', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999113', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999114', '巡检检查', '业务具体内容', '0', '1', '1', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999115', '巡检检查', '业务具体内容', '0', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999116', '微信投诉', '业务具体内容', '0', '1', '0', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999117', '微信投诉', '业务具体内容', '0', '1', '0', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999118', '微信投诉', '业务具体内容', '0', '1', '0', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999119', '微信投诉', '业务具体内容', '0', '1', '0', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999120', '微信投诉', '业务具体内容', '0', '1', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999121', '微信投诉', '业务具体内容', '0', '1', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999122', '微信投诉', '业务具体内容', '0', '1', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999123', '微信投诉', '业务具体内容', '0', '1', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999124', '微信投诉', '业务具体内容', '1', '1', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999125', '微信投诉', '业务具体内容', '1', '1', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999126', '微信投诉', '业务具体内容', '1', '1', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999127', '微信投诉', '业务具体内容', '1', '1', '0', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999128', '微信投诉', '业务具体内容', '1', '1', '0', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999129', '微信投诉', '业务具体内容', '1', '1', '0', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999130', '微信投诉', '业务具体内容', '1', '1', '0', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999131', '微信投诉', '业务具体内容', '1', '1', '0', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999132', '微信投诉', '业务具体内容', '1', '0', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999133', '微信投诉', '业务具体内容', '1', '0', '0', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999134', '微信投诉', '业务具体内容', '1', '0', '0', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999135', '微信投诉', '业务具体内容', '1', '0', '1', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999136', '微信投诉', '业务具体内容', '1', '0', '1', '2', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999137', '微信投诉', '业务具体内容', '1', '0', '1', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999138', '微信投诉', '业务具体内容', '1', '0', '1', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999139', '微信投诉', '业务具体内容', '1', '0', '1', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999140', '微信投诉', '业务具体内容', '1', '0', '1', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999141', '微信投诉', '业务具体内容', '1', '0', '1', '1', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999142', '微信投诉', '业务具体内容', '1', '0', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999143', '微信投诉', '业务具体内容', '1', '0', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999144', '微信投诉', '业务具体内容', '1', '0', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999145', '微信投诉', '业务具体内容', '1', '0', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999146', '微信投诉', '业务具体内容', '1', '0', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999147', '微信投诉', '业务具体内容', '1', '0', '1', '3', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999148', '微信投诉', '业务具体内容', '1', '0', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999149', '微信投诉', '业务具体内容', '1', '0', '1', '3', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999150', '微信投诉', '业务具体内容', '1', '0', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999151', '微信投诉', '业务具体内容', '1', '0', '1', '3', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999152', '微信投诉', '业务具体内容', '1', '0', '1', '3', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999153', '微信投诉', '业务具体内容', '1', '0', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999154', '微信投诉', '业务具体内容', '1', '1', '1', '3', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999155', '微信投诉', '业务具体内容', '1', '1', '1', '3', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999156', '微信投诉', '业务具体内容', '1', '1', '1', '3', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999157', '微信投诉', '业务具体内容', '1', '1', '1', '0', '0000-00-00');
INSERT INTO `tasklist` VALUES ('999158', '微信投诉', '业务具体内容', '1', '1', '1', '0', '0000-00-00');

-- ----------------------------
-- Table structure for `videos`
-- ----------------------------
DROP TABLE IF EXISTS `videos`;
CREATE TABLE `videos` (
  `VideoId` varchar(30) NOT NULL,
  `ComplaintId` varchar(30) NOT NULL,
  `VideoPath` text NOT NULL,
  PRIMARY KEY (`VideoId`),
  KEY `Video_Complaint_FK` (`ComplaintId`),
  CONSTRAINT `Video_Complaint_FK` FOREIGN KEY (`ComplaintId`) REFERENCES `customercomplaint` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of videos
-- ----------------------------
